Repository: ProgMFr/SteamPassApp
Catalog: lib/l10n/app_*.arb
Languages: ar, ru, tr

# countryCode
source: gb
ar: iq
ru: ru
tr: tr

# languageName
source: English
ar: العربية
ru: Русский
tr: Türkçe

# search
source: Search Game
ar: البحث
ru: Поиск игры
tr: Oyun Ara

# darkMode
source: Dark Theme
ar: الثيم الليلي
ru: Тёмная тема
tr: Koyu Tema

# lightMode
source: Light Theme
ar: الثيم النهاري
ru: Светлая тема
tr: Açık Tema

source: Light
ar: نهاري
ru: Светлая
tr: Açık

source: Dark
ar: ليلي
ru: Тёмная
tr: Koyu

# appName
source: SteamPass
ar: ستيـم بــاس

# savedgames
source: Added Games
ar: الالعاب المضافة
ru: Добавленные игры
tr: Eklenen Oyunlar

# manifestopen
source: Unlock Game
ar: فتح الترخيص
ru: Разблокировать игру
tr: Oyunun Kilidini Aç

# error
source: An error occurred.
ar: حدث خطأ
ru: Произошла ошибка.
tr: Bir hata oluştu.

source: Settings
ar: الإعدادات
ru: Настройки
tr: Ayarlar

# dLLFileNotFound
source: Required DLL Not Fount
ar: ملف dll مطلوب غير موجود
ru: Требуемый DLL не найден
tr: Gerekli DLL Bulunamadı

# dllFileInfoHeader
source: Details About This DLL
ar: معلومات عن الملف
ru: Подробности об этой DLL
tr: Bu DLL Hakkında Detaylar

source: Restart Steam
ar: اعادة تشغيل ستيم
ru: Перезапустить Steam
tr: Steam'i Yeniden Başlat

source: Close Steam
ar: اغلاق ستيم
ru: Закрыть Steam
tr: Steam'i Kapat

source: Close
ar: اغلاق
ru: Закрыть
tr: Kapat

source: Download
ar: تحميل
ru: Скачать
tr: İndir

# continueDl
source: Continue Get License
ar: متابعة تحميل الترخيص
ru: Продолжить разблокировку манифеста
tr: Lisans Almaya Devam Et

# unlockManifest
source: Get License
ar: فتح الترخيص
ru: Разблокировать
tr: Lisans Al

# dllFileInfo
source: This DLL will injected into Steam Client and modifies it's behavior, making it believe you own the licenses for these games by the Family Sharing feature. When the original game licenses are downloaded, they are injected directly into the Steam client. This unlock the game inside steam and allows you to download the original game files from Steam's servers, in addition to accessing all Steam services like achievements, cloud saves for your game progress, as well as downloading mods from the Workshop and receiving the latest game updates.
ar: يتم حقن هذا ال dll في ستيم ويقوم بتعديل سلوكه مما يجعله يعتقد انك تملك تراخيص هذه الالعاب عن طريق ميزة مشاركة العائلة عندما تقوم بتحميل التراخيص الاصلية لاي لعبة يتم حقنها مباشرة في ستيم كلاينت، مما يسمح لك بتحميل الملفات الاصلية للعبة من خلال سيرفرات ستيم بالاضافة الى الوصول الى كل خدمات ستيم مثل حفظ الانجازات والتخزين السحابي لتقدمك في اللعبة وبالاضافة الى تحميل المودات من الوورك شوب وتحميل اخر تحديثات اللعبة.
ru: Этот DLL-файл будет внедрён в клиент Steam и изменит его поведение, заставляя его считать, что вы владеете лицензиями на эти игры через функцию "Семейный доступ". Когда оригинальные лицензии на игры загружаются, они внедряются непосредственно в клиент Steam. Это разблокирует игру в Steam и позволит вам загружать оригинальные файлы игры с серверов Steam, а также предоставит доступ ко всем сервисам Steam, таким как достижения, облачные сохранения вашего игрового прогресса, загрузка модов из Мастерской и получение последних обновлений игры.
tr: Bu DLL, Steam İstemcisine enjekte edilecek ve davranışını değiştirerek, Aile Paylaşımı özelliği aracılığıyla bu oyunların lisanslarına sahip olduğunuza inanmasını sağlayacaktır.\n\nOrijinal oyun lisansları indirildiğinde, doğrudan Steam istemcisine enjekte edilir.\n\nBu, Steam içindeki oyunun kilidini açar ve Steam sunucularından orijinal oyun dosyalarını indirmenize, ayrıca başarımlar, oyun ilerlemeniz için bulut kayıtları gibi tüm Steam servislerine erişmenize, Atölye'den mod indirmenize ve en son oyun güncellemelerini almanıza olanak tanır.

# dllFileInfoNote
source: Important: No permissions required, and no modifications or changes are made to your Steam account. The licenses are saved locally into the Steam folder and your account is not affected by them.
ar: مهم: لا يتم طلب أي صلاحيات ولا يتم عمل اي تعديل او تغيير في حساب الستيم الخاص بك حيث يتم تحميل التراخيص في مجلد ستيم محليا ولا يتأثر حسابك بها
ru: Важно: Никаких разрешений не требуется, и в ваш аккаунт Steam не вносится никаких изменений. Лицензии сохраняются локально в папку Steam, и это никак не влияет на ваш аккаунт.
tr: Önemli: Herhangi bir izin istenmez ve Steam hesabınızda herhangi bir değişiklik yapılmaz. Lisanslar yerel olarak Steam klasörüne kaydedilir ve hesabınız bundan etkilenmez.

# steamPassRequired
source: SteamPass Need This DLL To Work Fine
ar: SteamPass يحتاج هذا الملف لكي يعمل
ru: Для корректной работы SteamPass требуется этот DLL-файл
tr: SteamPass'in Düzgün Çalışması İçin Bu DLL Gerekli

# gameNotFoundTitle
source: License Not Found
ar: الترخيص غير متوفر
ru: Лицензия не найдена
tr: Lisans Bulunamadı

# gameNotFoundError
source: No license is currently available for this game.
ar: لا يتوفر اي ترخيص حاليا لهذه اللعبة
ru: Лицензия для этой игры в данный момент недоступна.
tr: Bu oyun için şu anda mevcut bir lisans yok.

# githubReachLimitError
source: The request was rejected by GitHub because you have used all available free attempts. Please wait until:
ar: تم رفض الطلب بواسطة github لانك قمت بأستهلاك جميع المحاولات المجانية يرجى الانتظار الى :
ru: Запрос был отклонён GitHub, так как вы использовали все доступные бесплатные попытки. Пожалуйста, подождите до:
tr: İstek, mevcut tüm ücretsiz denemeleri kullandığınız için GitHub tarafından reddedildi. Lütfen şu zamana kadar bekleyin:

source: Connection Error
ar: خطأ في الاتصال
ru: Ошибка соединения
tr: Bağlantı Hatası

# dllFileNotFoundError
source: The required DLL file was not found. Please contact support.
ar: لم يتم العثور على ملف الdll المطلوب الرجاء مراسلة الدعم
ru: Требуемый DLL-файл не найден. Пожалуйста, обратитесь в поддержку.
tr: Gerekli DLL dosyası bulunamadı. Lütfen destek ile iletişime geçin.

# manifestNotFountError
source: Game License not found
ar: لم يتم العثور على تراخيص اللعبة
ru: Лицензия на игру не найдена
tr: Oyun Lisansı bulunamadı

# gameAddedSuccess
source: License activated successfully
ar: تم فتح الترخيص بنجاح
ru: Лицензия успешно активирована
tr: Lisans başarıyla etkinleştirildi

# restartSteamCaption
source: Please restart Steam for the added game to appear.
ar: قم بأعادة تشغيل ستيم لكي تظهر لك اللعبة التي قمت بأضافتها
ru: Пожалуйста, перезапустите Steam, чтобы добавленная игра появилась.
tr: Eklenen oyunun görünmesi için lütfen Steam'i yeniden başlatın.

# searchingGame
source: Searching...
ar: جاري البحث
ru: Поиск...
tr: Aranıyor...

# manifestFound
source: License found
ar: تم العثور على ترخيص
ru: Лицензия найдена
tr: Lisans bulundu

# searchingManifest
source: Searching for License
ar: جاري البحث عن ترخيص
ru: Поиск лицензии
tr: Lisans Aranıyor

# downloadingFile
source: Downloading :
ar: جاري تحميل :
ru: Загрузка:
tr: İndiriliyor :

# noGameUnlockedYet
source: No licenses added yet
ar: لم يتم اضافة اي تراخيص حتى الان
ru: Пока нет разблокированных игр
tr: Henüz hiç lisans eklenmedi

source: Files
ar: ملفات
ru: Файлы
tr: Dosyalar

source: Please wait...
ar: يرجى الانتظار...
ru: Подождите...
tr: Lütfen bekleyin...

source: Go to Settings
ar: فتح الاعدادات
ru: Перейти в настройки
tr: Ayarlara Git

# deleteManifest
source: Delete License
ar: حذف الترخيص
ru: удалить
tr: Lisansı Sil

# filesWillRemoved
source: Files that will be removed
ar: الملفات التي ستحذف
ru: Файлы, которые будут удалены
tr: Kaldırılacak dosyalar

source: Cancel
ar: الغاء
ru: Отмена
tr: İptal

# dllFileSuccessDl
source: DLL Add successfully
ar: تم اضافة الملف المطلوب
ru: DLL-файл успешно добавлен
tr: DLL başarıyla eklendi

# dllFileDownloading
source: Downloading DLL File
ar: جاري تحميل الملف المطلوب
ru: Загрузка DLL-файла
tr: DLL Dosyası İndiriliyor

# searchGameHint
source: Enter Game Name
ar: ادخل اسم اللعبة
ru: Введите название игры
tr: Oyun Adı Girin

# theme
source: Theme Mode
ar: الثيم
ru: Тема оформления
tr: Tema Modu

# language
source: App Language
ar: لغة التطبيق
ru: Язык приложения
tr: Uygulama Dili

source: Appearance
ar: اعدادات المظهر
ru: Внешний вид
tr: Görünüm

source: General Settings
ar: الاعدادات الاساسية
ru: Общие настройки
tr: Genel Ayarlar

# steamTools
source: Steam Management
ar: ادارة ستيم
ru: Управление Steam
tr: Steam Yönetimi

# githubApiKey
source: Your GitHub API Key
ar: مفتاح Github Api الخاص بك
ru: Ваш ключ API GitHub
tr: GitHub API Anahtarınız

# deleteAllManifest
source: Delete All licenses
ar: حذف جميع التراخيص
ru: Удалить все манифесты
tr: Tüm lisansları sil

# version
source: App Version
ar: الاصدار
ru: Версия приложения
tr: Uygulama Sürümü

source: Steam Status
ar: حالة ستيم
ru: Статус Steam
tr: Steam Durumu

# steamIsOpen
source: Active
ar: نشط
ru: Активен
tr: Aktif

# steamIsClosed
source: Closed
ar: مغلق
ru: Закрыто
tr: Kapalı

source: Copy Game ID
ar: نسخ معرف اللعبة
ru: Скопировать ID игры
tr: Oyun ID'sini Kopyala

source: Game ID Copied
ar: تم نسخ معرف اللعبة
ru: ID игры скопирован
tr: Oyun ID'si Kopyalandı

# visitSteamPassWebsite
source: Open SteamPass Website
ar: زيارة موقع SteamPass
ru: Посетить сайт SteamPass
tr: SteamPass Web Sitesini Aç

source: Instagram Contact
ar: تواصل Instagram
ru: Instagram Контакт
tr: Instagram İletişim

source: Telegram Contact
ar: تواصل Telegram
ru: Telegram Контакт
tr: Telegram İletişim

source: Update Available
ar: تحديث متاح
ru: Доступно обновление
tr: Güncelleme Mevcut

source: Update Notes
ar: ملاحظات التحديث
ru: Примечания к обновлению
tr: Güncelleme Notları

# updateVersion
source: Version : {version}
ar: الإصدار : {version}
ru: Версия : {version}
tr: Sürüm : {version}

# updateDate
source: Release Date : {release_date}
ar: تاريخ الإصدار : {release_date}
ru: Дата выпуска : {release_date}
tr: Yayın Tarihi : {release_date}

# updateSize
source: Update Size : {release_size}
ar: حجم التحديث : {release_size}
ru: Размер обновления : {release_size}
tr: Güncelleme Boyutu : {release_size}

source: Download Update
ar: تحميل التحديث
ru: Скачать обновление
tr: Güncellemeyi İndir

source: Update Later
ar: تحديث لاحقًا
ru: Обновить позже
tr: Daha Sonra Güncelle

source: Enable SteamPass
ar: تفعيل SteamPass
ru: Включить SteamPass
tr: SteamPass'i Etkinleştir

source: Enabled
ar: مفعل
ru: Включено
tr: Etkin

source: Disabled
ar: معطل
ru: Отключено
tr: Devre Dışı

source: Steam Not Installed
ar: ستيم غير مثبت
ru: Steam не установлен
tr: Steam Yüklü Değil

source: No Results Found
ar: لا توجد نتائج
ru: Результаты не найдены
tr: Sonuç Bulunamadı

# mustAddGameFirst
source: You must add a game first
ar: يجب عليك اضافة لعبة اولا
ru: Сначала добавьте игру
tr: Önce bir oyun eklemelisiniz

# githubRepo
source: Tool Repo On GitHub
ru: Репозиторий приложения на GitHub
tr: GitHub'daki Araç Reposu
